src/cf/Documents/Обучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Обучения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетВремениПоКомпетенциям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбучений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбучений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееКоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Компетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/УчетВремениПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>УчетВремениПоКомпетенциям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыОбучений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыОбучений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Назначено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Обучения/Ext/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	ОбученияУчастники.Сотрудник,
//	|	ОбученияУчастники.Ссылка
//	|ИЗ
//	|	Справочник.Обучения.Участники КАК ОбученияУчастники
//	|ГДЕ
//	|	НЕ ОбученияУчастники.Ссылка = &Источник
//	|	И ОбученияУчастники.Ссылка.ДатаОбучения = &ДатаОбучения";
//	
//	Запрос.УстановитьПараметр("Источник"	, Ссылка);
//	Запрос.УстановитьПараметр("ДатаОбучения", Дата);
//	
//	ВыгрузкаРезультатовЗапроса = Запрос.Выполнить().Выгрузить();
//	
//	Ошибки = Неопределено;
//	Для Каждого УчастникОбучения Из Участники Цикл
//		
//		ПоискСотрудника = ВыгрузкаРезультатовЗапроса.Найти(УчастникОбучения.Сотрудник, "Сотрудник");
//		Если ПоискСотрудника <> Неопределено Тогда
//			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				"ru = 'Сотрудник %1 уже участвует в обучении ""%2"", назначенное на это время'",
//				УчастникОбучения.Сотрудник, ПоискСотрудника.Ссылка);
//			
//			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , НСтр(ТекстСообщения));
//		КонецЕсли;
//		
//	КонецЦикла;
//	 
//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = Документы.Обучения.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыПроведения.Свойство("Реквизиты") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента	= ПараметрыПроведения.Реквизиты;
	УчастникиТаблица	= ПараметрыПроведения.ВременнаяТаблицаУчастники;
	КомпетенцииТаблица	= ПараметрыПроведения.ВременнаяТаблицаКомпетенции;
	
	Если Статус = Перечисления.СтатусыОбучений.Выполнено Тогда
		КомпетенцииМассив = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КомпетенцииТаблица.ВыгрузитьКолонку("Компетенция"));
		ГрадацииВремени = ОценкаСотрудниковСервер.ПолучитьГрадацииВремениПоКомпетенциям(КомпетенцииМассив);
		
		Если РеквизитыДокумента.ОбщееКоличествоЧасов <> 0 Тогда
			КоличествоКомпетенций = КомпетенцииМассив.Количество();	
			КоличествоВремениНаКомпетенцию = КоличествоЧасов / КоличествоКомпетенций;
		КонецЕсли;
		
		Движения.УчетВремениПоКомпетенциям.Очистить();
		
		Для Каждого УчастникСтрока Из УчастникиТаблица Цикл
			
			УчастникОбучения = УчастникСтрока.Сотрудник;
			
			Для Каждого КомпетенцияСтрока Из КомпетенцииТаблица Цикл
				
				КомпетенцияОбучения = КомпетенцияСтрока.Компетенция;
				
				НоваяЗапись = Движения.УчетВремениПоКомпетенциям.Добавить();
				НоваяЗапись.Период		= РеквизитыДокумента.Дата;
				НоваяЗапись.Регистратор	= РеквизитыДокумента.Ссылка;
				НоваяЗапись.Сотрудник	= УчастникОбучения;
				НоваяЗапись.Компетенция	= КомпетенцияОбучения;
				
				Если РеквизитыДокумента.ОбщееКоличествоЧасов <> 0 Тогда
					КоличествоЧасов = КоличествоВремениНаКомпетенцию;
				Иначе
					КоличествоЧасов = КомпетенцияСтрока.КоличествоЧасов;
				КонецЕсли;
				
				НоваяЗапись.Часов	= КоличествоЧасов;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Движения.УчетВремениПоКомпетенциям.Записывать = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid object call on client.'");
#КонецЕсли
